# 1. Найти всех менеджеров:
# Напишите запрос, который выбирает FirstName, LastName и Position для всех сотрудников,
# чья должность (Position) равна 'Менеджер'.

# 2. Найти разработчиков или тестировщиков:
# Напишите запрос, который выбирает FirstName, LastName и Position для сотрудников,
# чья должность (Position) 'Разработчик' ИЛИ 'Тестировщик'. Используйте оператор OR или IN.

# 3. Найти сотрудников, чья фамилия начинается с 'И' и должность не 'Бухгалтер':
# Напишите запрос, который выбирает FirstName, LastName и Position для сотрудников,
# у которых LastName начинается с буквы 'И' (используйте LIKE) И их Position НЕ является 'Бухгалтер'.